app/services/create_weather_cache_service.rb

  def call
    #TODO not tested not fully functional
    weather = FetchWeatherDataFromApiService.new(@params).call
    location = Location.find_or_create_by(city: @params[:city]) if @params[:city]
    location = Location.find_or_create_by(latitude: @params[:latitude], longitude: @params[:longitude]) if @params[:latitude] && @params[:longitude]
    location.weather.destroy if location.weather.exists?
---
SELECT "locations".* FROM "locations" WHERE "locations"."city" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "locations".* FROM "locations" WHERE "locations"."latitude" = ? AND "locations"."longitude" = ? LIMIT ?  [["latitude", 26.912434], ["longitude", 75.787271], ["LIMIT", 1]]
SELECT 1 AS one FROM "locations" WHERE "locations"."city" IS NULL LIMIT ?  [["LIMIT", 1]]