app/services/location_finder_service.rb

  def location_by_lat_long
    if @params[:latitude] && @params[:longitude]
      Location.find_by(
        latitude: @params[:latitude],
        longitude: @params[:longitude]
      )
---
SELECT "locations".* FROM "locations" WHERE "locations"."latitude" = ? AND "locations"."longitude" = ? LIMIT ?  [["latitude", "26.9124336"], ["longitude", "75.7872709"], ["LIMIT", 1]]